// ·· try..catch..finally

/*
Сравните два фрагмента кода.

Первый использует finally для выполнения кода после try..catch:
*/
try {
  // начать работу работать
} catch (e) {
  // обработать ошибку
} finally {
  // очистить рабочее пространство
}

// Второй фрагмент просто ставит очистку после try..catch:

try {
  // начать работу работать
} catch (e) {
  // обработать ошибку
}

/*
Есть ли здесь преимущество в использовании finally или оба фрагмента кода одинаковы? 
Если такое преимущество есть, то дайте пример, когда оно проявляется.

Ответ: Преимущество есть. Блок finally выполняется при любом расскладе, даже если есть ошибка в блоке try.
То есть, допустим, что в блоке try есть ошибка, и catch ее нашел и вывелся в консоль сообщением. После этого finally выполняется в любом случае.
*/

// ·· Arrow Functions

// Замените код Function Expression стрелочной функцией:

function ask(question, yes, no) {
  if (confirm(question)) yes();
  else no();
}

ask(
  "Вы согласны?",
  function () {
    alert("Вы согласились.");
  },
  function () {
    alert("Вы отменили выполнение.");
  },
);

// ·· This - метод объекта

/* Number 1

Здесь функция makeUser возвращает объект.
Каким будет результат при обращении к свойству объекта ref? Почему?
*/

function makeUser() {
  return {
    name: "John",
    ref: this,
  };
}

let user = makeUser();

alert(user.ref.name); // Каким будет результат?

/* Number 2

Создайте объект calculator (калькулятор) с тремя методами:

read() (читать) запрашивает два значения и сохраняет их как свойства объекта с именами a и b.
sum() (суммировать) возвращает сумму сохранённых значений.
mul() (умножить) перемножает сохранённые значения и возвращает результат.
*/

let calculator = {
  // ... ваш код ...
};

calculator.read();
alert(calculator.sum());
alert(calculator.mul());

/* Number 3

У нас есть объект ladder (лестница), который позволяет подниматься и спускаться:
*/

let ladder = {
  step: 0,
  up() {
    this.step++;
  },
  down() {
    this.step--;
  },
  showStep: function () {
    // показывает текущую ступеньку
    alert(this.step);
  },
};

// Теперь, если нам нужно выполнить несколько последовательных вызовов, мы можем сделать это так:

ladder.up();
ladder.up();
ladder.down();
ladder.showStep(); // 1
ladder.down();
ladder.showStep(); // 0

// Измените код методов up, down и showStep таким образом, чтобы их вызов можно было сделать по цепочке, например так:

ladder.up().up().down().showStep().down().showStep(); // показывает 1 затем 0

// Такой подход широко используется в библиотеках JavaScript.
